results/fastapi-10-1k.1.log

Summary:
  Total:	0.0623 secs
  Slowest:	0.0049 secs
  Fastest:	0.0002 secs
  Average:	0.0006 secs
  Requests/sec:	16045.1402
  
  Total data:	4000 bytes
  Size/request:	4 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [806]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [173]	|■■■■■■■■■
  0.002 [9]	|
  0.002 [1]	|
  0.003 [0]	|
  0.003 [0]	|
  0.004 [0]	|
  0.004 [0]	|
  0.004 [1]	|
  0.005 [9]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0005 secs
  50% in 0.0005 secs
  75% in 0.0006 secs
  90% in 0.0007 secs
  95% in 0.0009 secs
  99% in 0.0044 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0002 secs, 0.0049 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0016 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0005 secs, 0.0002 secs, 0.0017 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	1000 responses