results/fastapi-10-1k.3.log

Summary:
  Total:	0.0604 secs
  Slowest:	0.0054 secs
  Fastest:	0.0002 secs
  Average:	0.0006 secs
  Requests/sec:	16569.7796
  
  Total data:	4000 bytes
  Size/request:	4 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [849]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [136]	|■■■■■■
  0.002 [4]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [0]	|
  0.004 [0]	|
  0.004 [0]	|
  0.005 [5]	|
  0.005 [5]	|


Latency distribution:
  10% in 0.0004 secs
  25% in 0.0004 secs
  50% in 0.0005 secs
  75% in 0.0006 secs
  90% in 0.0008 secs
  95% in 0.0009 secs
  99% in 0.0043 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0002 secs, 0.0054 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0005 secs, 0.0002 secs, 0.0021 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	1000 responses