results/fastapi-100-1k.2.log

Summary:
  Total:	0.0444 secs
  Slowest:	0.0190 secs
  Fastest:	0.0002 secs
  Average:	0.0038 secs
  Requests/sec:	22499.6555
  
  Total data:	4000 bytes
  Size/request:	4 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [355]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [395]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [126]	|■■■■■■■■■■■■■
  0.008 [20]	|■■
  0.010 [4]	|
  0.012 [18]	|■■
  0.013 [24]	|■■
  0.015 [38]	|■■■■
  0.017 [18]	|■■
  0.019 [1]	|


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0018 secs
  50% in 0.0026 secs
  75% in 0.0040 secs
  90% in 0.0090 secs
  95% in 0.0138 secs
  99% in 0.0161 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0002 secs, 0.0190 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0029 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0031 secs
  resp wait:	0.0027 secs, 0.0002 secs, 0.0088 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0032 secs

Status code distribution:
  [200]	1000 responses