results/fastapi-100-1k.3.log

Summary:
  Total:	0.0429 secs
  Slowest:	0.0180 secs
  Fastest:	0.0002 secs
  Average:	0.0036 secs
  Requests/sec:	23318.2668
  
  Total data:	4000 bytes
  Size/request:	4 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [372]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.004 [389]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [99]	|■■■■■■■■■■
  0.007 [25]	|■■■
  0.009 [13]	|■
  0.011 [10]	|■
  0.013 [23]	|■■
  0.014 [36]	|■■■■
  0.016 [24]	|■■
  0.018 [8]	|■


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0017 secs
  50% in 0.0023 secs
  75% in 0.0037 secs
  90% in 0.0094 secs
  95% in 0.0138 secs
  99% in 0.0155 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0002 secs, 0.0180 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0035 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0011 secs
  resp wait:	0.0027 secs, 0.0002 secs, 0.0091 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0015 secs

Status code distribution:
  [200]	1000 responses