results/laravel-octane-10-1k.1.log

Summary:
  Total:	1.6923 secs
  Slowest:	0.3860 secs
  Fastest:	0.0018 secs
  Average:	0.0169 secs
  Requests/sec:	590.9038
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.002 [1]	|
  0.040 [969]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.079 [0]	|
  0.117 [0]	|
  0.156 [0]	|
  0.194 [0]	|
  0.232 [0]	|
  0.271 [0]	|
  0.309 [0]	|
  0.348 [10]	|
  0.386 [20]	|■


Latency distribution:
  10% in 0.0037 secs
  25% in 0.0040 secs
  50% in 0.0047 secs
  75% in 0.0059 secs
  90% in 0.0107 secs
  95% in 0.0287 secs
  99% in 0.3808 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.3860 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0007 secs
  resp wait:	0.0168 secs, 0.0018 secs, 0.3860 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	1000 responses