results/laravel-octane-10-1k.3.log

Summary:
  Total:	2.5486 secs
  Slowest:	0.5467 secs
  Fastest:	0.0023 secs
  Average:	0.0161 secs
  Requests/sec:	392.3680
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.002 [1]	|
  0.057 [974]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.111 [0]	|
  0.166 [0]	|
  0.220 [0]	|
  0.274 [0]	|
  0.329 [2]	|
  0.383 [0]	|
  0.438 [20]	|■
  0.492 [0]	|
  0.547 [3]	|


Latency distribution:
  10% in 0.0038 secs
  25% in 0.0042 secs
  50% in 0.0050 secs
  75% in 0.0064 secs
  90% in 0.0116 secs
  95% in 0.0182 secs
  99% in 0.3951 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0023 secs, 0.5467 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0160 secs, 0.0022 secs, 0.5466 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	1000 responses