results/laravel-octane-100-1k.1.log

Summary:
  Total:	1.3178 secs
  Slowest:	0.5125 secs
  Fastest:	0.0037 secs
  Average:	0.1284 secs
  Requests/sec:	758.8613
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.004 [1]	|
  0.055 [677]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.105 [122]	|■■■■■■■
  0.156 [0]	|
  0.207 [0]	|
  0.258 [0]	|
  0.309 [0]	|
  0.360 [0]	|
  0.411 [0]	|
  0.462 [123]	|■■■■■■■
  0.512 [77]	|■■■■■


Latency distribution:
  10% in 0.0305 secs
  25% in 0.0455 secs
  50% in 0.0485 secs
  75% in 0.0683 secs
  90% in 0.4525 secs
  95% in 0.4781 secs
  99% in 0.5075 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0009 secs, 0.0037 secs, 0.5125 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0032 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.1275 secs, 0.0036 secs, 0.5124 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0020 secs

Status code distribution:
  [200]	1000 responses