results/laravel-octane-100-1k.2.log

Summary:
  Total:	1.5273 secs
  Slowest:	0.5033 secs
  Fastest:	0.0075 secs
  Average:	0.1495 secs
  Requests/sec:	654.7683
  
  Total data:	2000 bytes
  Size/request:	2 bytes

Response time histogram:
  0.007 [1]	|
  0.057 [523]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.107 [176]	|■■■■■■■■■■■■■
  0.156 [0]	|
  0.206 [31]	|■■
  0.255 [69]	|■■■■■
  0.305 [0]	|
  0.355 [0]	|
  0.404 [0]	|
  0.454 [28]	|■■
  0.503 [172]	|■■■■■■■■■■■■■


Latency distribution:
  10% in 0.0254 secs
  25% in 0.0482 secs
  50% in 0.0560 secs
  75% in 0.2184 secs
  90% in 0.4751 secs
  95% in 0.4839 secs
  99% in 0.4960 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.0075 secs, 0.5033 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0036 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0161 secs
  resp wait:	0.1486 secs, 0.0042 secs, 0.5032 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0147 secs

Status code distribution:
  [200]	1000 responses