results/rails-10-1k.1.log

Summary:
  Total:	3.3934 secs
  Slowest:	0.2142 secs
  Fastest:	0.0039 secs
  Average:	0.0330 secs
  Requests/sec:	294.6939
  

Response time histogram:
  0.004 [1]	|
  0.025 [888]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.046 [16]	|■
  0.067 [0]	|
  0.088 [0]	|
  0.109 [0]	|
  0.130 [0]	|
  0.151 [0]	|
  0.172 [0]	|
  0.193 [77]	|■■■
  0.214 [18]	|■


Latency distribution:
  10% in 0.0140 secs
  25% in 0.0155 secs
  50% in 0.0169 secs
  75% in 0.0189 secs
  90% in 0.0282 secs
  95% in 0.1858 secs
  99% in 0.1972 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0039 secs, 0.2142 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0016 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0328 secs, 0.0039 secs, 0.2112 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	1000 responses