results/rails-10-1k.3.log

Summary:
  Total:	3.3758 secs
  Slowest:	0.2185 secs
  Fastest:	0.0030 secs
  Average:	0.0329 secs
  Requests/sec:	296.2296
  

Response time histogram:
  0.003 [1]	|
  0.025 [885]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.046 [16]	|■
  0.068 [1]	|
  0.089 [0]	|
  0.111 [0]	|
  0.132 [0]	|
  0.154 [0]	|
  0.175 [15]	|■
  0.197 [70]	|■■■
  0.219 [12]	|■


Latency distribution:
  10% in 0.0135 secs
  25% in 0.0153 secs
  50% in 0.0168 secs
  75% in 0.0188 secs
  90% in 0.0339 secs
  95% in 0.1855 secs
  99% in 0.1976 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0030 secs, 0.2185 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0030 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0327 secs, 0.0030 secs, 0.2153 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0011 secs

Status code distribution:
  [200]	1000 responses